# Making Database
sqlite서버와 연결 후 Demo Database는 같은 디렉토리에 있는 Northwind.db로 합니다.

## base Variables and functions

In [ ]:
# reset database
!pwd
!rm Northwind.db
!cp Northwind_Ori.db Northwind.db
!ls

/Users/admin/Documents/GitHub/DataEngineering/W1/M2
Northwind.db       Northwind_Ori.db   SQL Tutorial.ipynb my.db

In [3]:
import sqlite3

#database = 'my.db'
database = 'Northwind.db'
def sendQuery(sql):
    try:
        with sqlite3.connect(database) as conn:
            cursor = conn.cursor()
            cursor.execute(sql)
            conn.commit()
            return cursor.fetchall()
        
    except sqlite3.Error as e:
        print(e)

def sendQueryWithData(sql, data):
    try:
        with sqlite3.connect(database) as conn:
            cursor = conn.cursor()
            for date in data:
                cursor.execute(sql, date)
            conn.commit()
        
        return cursor.fetchall()
        
    except sqlite3.Error as e:
        print(e)

# main tutorials

## SELECT
SELECT는 원하는 테이블에서 원하는 Column에 해당하는 데이터를 반환하는 쿼리문이다.

In [ ]:
sql = "SELECT * FROM Customers;"
sendQuery(sql)

In [ ]:
sql = "SELECT CustomerName, City FROM Customers;"
sendQuery(sql)

In [ ]:
sql = "SELECT DISTINCT Country FROM Customers;"
sendQuery(sql)

In [ ]:
sql = "SELECT Country FROM Customers;"
sendQuery(sql)

DISTINCT는 처음본다. 실행해보면 중복되는 데이터는 지우고 준다는 것을 알 수 있다.

## WHERE
조건을 거는 구문이다.

In [ ]:
sql = "SELECT * FROM Customers WHERE Country='Mexico';"
sendQuery(sql)

In [ ]:
sql = """SELECT * FROM Customers
         WHERE CustomerID=1;"""
sendQuery(sql)

In [ ]:
sql = """SELECT * FROM Customers
         WHERE CustomerID > 80;"""
sendQuery(sql)

WHERE과 쓰일 수 있는 연산자는 =, >, <, >=, <=, <>, BETWEEN, LIKE, IN이 있다.

## ORDER BY
ORDER BY는 데이터를 정렬해주는 쿼리문이다.

In [ ]:
sql = "SELECT * FROM Products ORDER BY Price;"
sendQuery(sql)

In [ ]:
sql = "SELECT * FROM Products ORDER BY Price DESC;"
sendQuery(sql)

In [ ]:
sql = "SELECT * FROM Customers ORDER BY Country, CustomerName;"
sendQuery(sql)

In [ ]:
sql = "SELECT * FROM Customers ORDER BY Country ASC, CustomerName DESC;"
sendQuery(sql)

특징으로는 ASC, DESC를 뒤에 써줄 수 있다. 숫자뿐만 아니라 알파벳 문자열에도 사용 가능하며, 여러 column을 붙이면 맨 처음 입력한 칼럼부터 우선순위를 가지고 정렬한다.

## AND / OR / NOT
논리 연산자이다. AND, OR는 각 논리식을 연결하는데 사용된다. NOT은 이미 논리연산을 한 조건을 뒤집을 때 사용한다.

In [ ]:
sql = """ SELECT *
          FROM Customers
          WHERE Country = 'Spain' AND CustomerName Like 'G%'; """
sendQuery(sql)

In [ ]:
sql = """ SELECT *
          FROM Customers
          WHERE Country = 'Spain' OR Country = 'Germany'; """
sendQuery(sql)

In [ ]:
sql = """ SELECT DISTINCT Country FROM Customers
          WHERE NOT Country = 'Spain';"""
sendQuery(sql)

AND OR NOT을 섞어 쓸 수 있다. 연산자 우선순위는 AND가 OR보다 높다. NOT은 대부분의 경우에 연산자로 대체가 가능하다. 또, LIKE, BETWEEN, IN 앞에도 쓸 수 있다

## INSERT INTO
Table에 row를 추가하는 구문이다.

In [ ]:
sql = """ INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway'); """
sendQuery(sql)

In [ ]:
sql = "SELECT * FROM Customers WHERE CustomerName='Cardinal';"
sendQuery(sql)

Cardinal씨가 리스트에 잘 추가되었다.

## NUlL, IS NULL, IS NOT NULL
NULL 값은 아무 것도 입력이 안된 값이다.

In [ ]:
sql = """SELECT CustomerName, ContactName, Address
         FROM Customers
         WHERE Address IS NULL;"""
sendQuery(sql)

In [ ]:
sql = """SELECT CustomerName, ContactName, Address
         FROM Customers
         WHERE Address IS NOT NULL;"""
sendQuery(sql)

Customer 테이블에 주소가 등록되지 않은 사람은 아무도 없는 모양이다.

## UPDATE
데이터 값을 바꾸는(갱신하는) 쿼리문이다.

In [ ]:
sql = """UPDATE Customers
         SET ContactName = 'Alfred Schmidt', City= 'Frankfurt'
         WHERE CustomerID = 1;"""
sendQuery(sql)

In [ ]:
sql = """SELECT *
         FROM Customers
         WHERE CustomerID = 1;"""
sendQuery(sql)

알프레드씨의 정보가 잘 업데이트 되었다. UPDATE를 쓸 때는 WHERE로 조건을 꼭 걸어주자. 그렇지 않으면 모든 데이터가 업데이트 될 수 있다.

## DELETE, DROP
무언가를 삭제하는 쿼리문이다. 이하는 예문이다. 이하는 실행하지 않는 것을 추천한다. 다음에도 계속해서 Customer를 사용한다.

In [ ]:
#sql = "DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste';"
sendQuery(sql)

In [ ]:
#sql = "SELECT CustomerName FROM Customers;"
sendQuery(sql)

In [ ]:
#sql = "DELETE FROM Customers;"
sendQuery(sql)

In [ ]:
#sql = "DROP TABLE Customers;"
sendQuery(sql)

WHERE 조건문을 꼭 달자. 안그럼 테이블 전체가 다 지워진다.

## TOP, LIMIT, FETCH FIRST, ROWNUM
맨 위의 몇개의 row만 가져오게 제한을 거는 구문이다

In [ ]:
#sql = "SELECT TOP 3 * FROM Customers;"
sql = "SELECT * FROM Customers LIMIT 3;"
#sql = "SELECT * FROM Customers FETCH FIRST 3 ONLY;"
sendQuery(sql)

sql = "SELECT TOP 3 * FROM Customers;"
sql = "SELECT * FROM Customers LIMIT 3;"
sql = "SELECT * FROM Customers FETCH FIRST 3;"
다 같은 내용의 쿼리문이지만 두번째 LIMIT만 작동을 한다. 추측해보건데 PERCENT를 막기 위해 이렇게 된것이 아닐까 싶다.

In [ ]:
sql = """SELECT * FROM Customers LIMIT 3
         ORDER BY CustomerName DESC;"""
sendQuery(sql)

In [ ]:
sql = """SELECT * FROM Customers
         ORDER BY CustomerName DESC
         LIMIT 3;"""
sendQuery(sql)

sql = "SELECT * FROM Customers LIMIT 3 ORDER BY CustomerName DESC;"가 되지 않았다. LIMIT로 조금 받아온 데이터를 정렬하고 싶으면 어떻게 해야 하는가? 라는 질문이 생긴다.

## Aggregate Functions

### MIN, MAX (AS, GROUP BY)
지정한 Column의 최대, 최소를 반환한다.

In [ ]:
sql = "SELECT MIN(Price) FROM Products"
sendQuery(sql)

In [ ]:
sql = "SELECT MAX(Price) FROM Products"
sendQuery(sql)

In [ ]:
sendQuery("""SELECT MIN(Price) AS SmallestPrice, CategoryID
             FROM Products;
             GROUP BY CategoryID;""")

AS와 GROUP BY가 등장했다. AS는 TABLE의 칼럼 레이블을 원하는 다른 이름으로 바꿔서 SELECT의 결과로 보내주는 역할을 한다. 또한 Group by는 pandas의 그것과 같이 같은 값을 가진 row끼리 모아서 연산시키는 함수이다.

### COUNT
엑셀의 count 함수처럼 개수를 세준다

In [ ]:
sql = "SELECT COUNT(*) FROM Products"
sendQuery(sql)

where함수와 적절이 섞어 쓰면 엑셀의 countif함수처럼 사용할 수 있다.

### SUM

In [ ]:
sql = "SELECT SUM(Quantity) FROM OrderDetails;"
sendQuery(sql)

In [ ]:
sql = "SELECT OrderID, SUM(Quantity) AS [Total Quantity] FROM OrderDetails GROUP BY OrderID;"
sendQuery(sql)

In [ ]:
sql = """SELECT SUM(Price * Quantity)
FROM OrderDetails
LEFT JOIN Products ON OrderDetails.ProductID = Products.ProductID;"""
sendQuery(sql)

Where을 섞어 쓰면 sumif함수를 엑셀에서 쓰듯이 쓸 수 있고, GROUP BY를 이용하면 같은 값에 대한 다른 칼럼의 합을 구할 수 있다.

### AVG
말 그대로 평균을 구하는 함수이다.

In [ ]:
sql = "SELECT AVG(Price) FROM Products;"
sendQuery(sql)

In [ ]:
sql = "SELECT * FROM Products WHERE price > (SELECT AVG(price) FROM Products);"
sendQuery(sql)

sum과 마찬가지로 where과 같이 쓰면 조건에 부합하는 데이터의 평균이 구해지고, group by를 쓰면 해당 값과 동일한 값끼리 평균을 구하는 연산을 하게 된다. 특이한 쓰임세로는 where문 내부에 avg를 넣어서 평균보다 높은/낮은 값을 갖는 데이터를 불러올수도 있다.

## LIKE, wild card
정규 표현문을 사용하듯이 쓸 수 있는 키워드이다

In [ ]:
sql = "SELECT * FROM Customers WHERE CustomerName LIKE 'a%';"
sendQuery(sql)

이 키워드를 잘 쓰기 위해선 와일드카드를 잘 알아야 한다. 

* _는 해당 위치에 아무 문자나 와도 된다는 의미이다.
* %는 해당 위치에는 임의 길이를 갖는 문자열이 들어가도 된다는 의미이다.

## IN
WHERE과 함께 쓰여서 복수의 조건을 한번에 나타내기 위해 쓰인다.

In [ ]:
sql = "SELECT * FROM Customers WHERE Country IN ('Germany', 'France', 'UK');"
sendQuery(sql)

In [ ]:
sql = "SELECT * FROM Customers WHERE CustomerID IN (SELECT CustomerID FROM Orders);"
sendQuery(sql)

NOT과 함께 쓰여서 부정을 취할수도 있고 내부 조건으로 다른 SELECT의 결과를 줄 수도 있다.

## BETWEEN
범위를 결정하는 키워드이다. 숫자뿐 아니라 문자열 날짜에도 사용가능하다.

In [ ]:
sql = "SELECT * FROM Products WHERE Price BETWEEN 10 AND 20;"
sendQuery(sql)

In [ ]:
sql = """SELECT * FROM Products
         WHERE ProductName BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni'
         ORDER BY ProductName;"""
sendQuery(sql)

In [ ]:
sql = "SELECT * FROM Orders WHERE OrderDate BETWEEN '1996-07-01' AND '1996-07-31';"
sendQuery(sql)

## AS (Aliases)
테이블에서 불러오고자 하는 데이터의 column과 내가 다루고자 하는 데이터의 column이 다를 때 요긴하게 쓰인다. 쓰고자 하는 데이터 명에 스페이스 바, 공백문자가 들어가면 대괄호로 쳐서 해결하던가, 큰ㅈ따오포를 쳐서 해결해야 한다.

In [ ]:
sql = "SELECT CustomerID AS ID, CustomerName AS Customer FROM Customers;"
sendQuery(sql)

In [ ]:
#sql ="SELECT ProductName AS [My Great Products] FROM Products;"
sql ="SELECT ProductName AS ""My Great Products"" FROM Products;"
sendQuery(sql)

Table에도 가능하다.

In [ ]:
sql = "SELECT * FROM Customers AS Persons;"
sendQuery(sql)

In [ ]:
sql = "SELECT CustomerName, (Address || ', ' || PostalCode || ' ' || City || ', ' || Country) AS Address FROM Customers;"
sendQuery(sql)

## JOIN

join은 연관된 column을 기준으로 여러 테이블의 행을 이어 붙이는 명령어이다.

기본적으로 JOIN만 쓰면 각 테이블에 겹치는 column이 있는 행만 이어 붙이게 되고, LEFT/RIGHT/FULL JOIN등을 쓰게 되면 칼럼이 겹치지 않더라도 여러 테이블의 행을 이어 붙이게 된다.

In [ ]:
sql = """SELECT Orders.OrderID, Customers.CustomerName, Orders.OrderDate
         FROM Orders
         INNER JOIN Customers ON Orders.CustomerID=Customers.CustomerID;"""
sendQuery(sql)

In [ ]:
sql = """SELECT Customers.CustomerName, Orders.OrderID
         FROM Customers
         LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
         ORDER BY Customers.CustomerName;"""
sendQuery(sql)

In [ ]:
sql = """SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
         FROM Orders
         RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
         ORDER BY Orders.OrderID;"""
sendQuery(sql)

In [113]:
sql = """SELECT Customers.CustomerName, Orders.OrderID
         FROM Customers
         FULL OUTER JOIN Orders ON Customers.CustomerID=Orders.CustomerID
         ORDER BY Customers.CustomerName;"""

sendQuery(sql)

[('Alfreds Futterkiste', None),
 ('Blauer See Delikatessen', None),
 ('Cactus Comidas para llevar', None),
 ('FISSA Fabrica Inter. Salchichas S.A.', None),
 ('France restauration', None),
 ('Great Lakes Food Market', None),
 ("La corne d''abondance", None),
 ('Laughing Bacchus Wine Cellars', None),
 ('Lazy K Kountry Store', None),
 ("Let''s Stop N Shop", None),
 ('Maison Dewey', None),
 ('North/South', None),
 ('Paris spécialités', None),
 ('Rancho grande', None),
 ('Spécialités du monde', None),
 ('The Cracker Box', None),
 ("Trail''s Head Gourmet Provisioners", None),
 ('Wilman Kala', 10248),
 ('Tradição Hipermercados', 10249),
 ('Hanari Carnes', 10250),
 ('Victuailles en stock', 10251),
 ('Suprêmes délices', 10252),
 ('Hanari Carnes', 10253),
 ('Chop-suey Chinese', 10254),
 ('Richter Supermarkt', 10255),
 ('Wellington Importadora', 10256),
 ('HILARIÓN-Abastos', 10257),
 ('Ernst Handel', 10258),
 ('Centro comercial Moctezuma', 10259),
 ('Old World Delicatessen', 10260),
 ('Que Delícia', 10261),
 ('Rattlesnake Canyon Grocery', 10262),
 ('Ernst Handel', 10263),
 ('Folk och fä HB', 10264),
 ('Blondel père et fils', 10265),
 ('Wartian Herkku', 10266),
 ('Frankenversand', 10267),
 ('GROSELLA-Restaurante', 10268),
 ('White Clover Markets', 10269),
 ('Wartian Herkku', 10270),
 ('Split Rail Beer & Ale', 10271),
 ('Rattlesnake Canyon Grocery', 10272),
 ('QUICK-Stop', 10273),
 ('Vins et alcools Chevalier', 10274),
 ('Magazzini Alimentari Riuniti', 10275),
 ('Tortuga Restaurante', 10276),
 ('Morgenstern Gesundkost', 10277),
 ('Berglunds snabbköp', 10278),
 ('Lehmanns Marktstand', 10279),
 ('Berglunds snabbköp', 10280),
 ('Romero y tomillo', 10281),
 ('Romero y tomillo', 10282),
 ('LILA-Supermercado', 10283),
 ('Lehmanns Marktstand', 10284),
 ('QUICK-Stop', 10285),
 ('QUICK-Stop', 10286),
 ('Ricardo Adocicados', 10287),
 ('Reggiani Caseifici', 10288),
 ("B''s Beverages", 10289),
 ('Comércio Mineiro', 10290),
 ('Que Delícia', 10291),
 ('Tradição Hipermercados', 10292),
 ('Tortuga Restaurante', 10293),
 ('Rattlesnake Canyon Grocery', 10294),
 ('Vins et alcools Chevalier', 10295),
 ('LILA-Supermercado', 10296),
 ('Blondel père et fils', 10297),
 ('Hungry Owl All-Night Grocers', 10298),
 ('Ricardo Adocicados', 10299),
 ('Magazzini Alimentari Riuniti', 10300),
 ('Die Wandernde Kuh', 10301),
 ('Suprêmes délices', 10302),
 ('Godos Cocina Típica', 10303),
 ('Tortuga Restaurante', 10304),
 ('Old World Delicatessen', 10305),
 ('Romero y tomillo', 10306),
 ('Lonesome Pine Restaurant', 10307),
 ('Ana Trujillo Emparedados y helados', 10308),
 ('Hungry Owl All-Night Grocers', 10309),
 ('The Big Cheese', 10310),
 ('Du monde entier', 10311),
 ('Die Wandernde Kuh', 10312),
 ('QUICK-Stop', 10313),
 ('Rattlesnake Canyon Grocery', 10314),
 ('Island Trading', 10315),
 ('Rattlesnake Canyon Grocery', 10316),
 ('Lonesome Pine Restaurant', 10317),
 ('Island Trading', 10318),
 ('Tortuga Restaurante', 10319),
 ('Wartian Herkku', 10320),
 ('Island Trading', 10321),
 ('Pericles Comidas clásicas', 10322),
 ('Königlich Essen', 10323),
 ('Save-a-lot Markets', 10324),
 ('Königlich Essen', 10325),
 ('Bólido Comidas preparadas', 10326),
 ('Folk och fä HB', 10327),
 ('Furia Bacalhau e Frutos do Mar', 10328),
 ('Split Rail Beer & Ale', 10329),
 ('LILA-Supermercado', 10330),
 ("Bon app''", 10331),
 ('Mère Paillarde', 10332),
 ('Wartian Herkku', 10333),
 ('Victuailles en stock', 10334),
 ('Hungry Owl All-Night Grocers', 10335),
 ('Princesa Isabel Vinhoss', 10336),
 ('Frankenversand', 10337),
 ('Old World Delicatessen', 10338),
 ('Mère Paillarde', 10339),
 ("Bon app''", 10340),
 ('Simons bistro', 10341),
 ('Frankenversand', 10342),
 ('Lehmanns Marktstand', 10343),
 ('White Clover Markets', 10344),
 ('QUICK-Stop', 10345),
 ('Rattlesnake Canyon Grocery', 10346),
 ('Familia Arquibaldo', 10347),
 ('Die Wandernde Kuh', 10348),
 ('Split Rail Beer & Ale', 10349),
 ("La maison d''Asie", 10350),
 ('Ernst Handel', 10351),
 ('Furia Bacalhau e Frutos do Mar', 10352),
 ('Piccolo und mehr', 10353),
 ('Pericles Comidas clásicas', 10354),
 ('Around the Horn', 10355),
 ('Die Wandernde Kuh', 10356),
 ('LILA-Supermercado', 10357),
 ("La maison d''Asie", 10358),
 ('Seven Seas Imports', 10359),
 ('Blondel père et fils', 10360),
 ('QUICK-Stop', 10361),
 ("Bon app''", 10362),
 ('Drachenblut Delikatessend', 10363),
 ('Eastern Connection', 10364),
 ('Antonio Moreno Taquería', 10365),
 ('Galería del gastrónomo', 10366),
 ('Vaffeljernet', 10367),
 ('Ernst Handel', 10368),
 ('Split Rail Beer & Ale', 10369),
 ('Chop-suey Chinese', 10370),
 ("La maison d''Asie", 10371),
 ('Queen Cozinha', 10372),
 ('Hungry Owl All-Night Grocers', 10373),
 ('Wolski', 10374),
 ('Hungry Coyote Import Store', 10375),
 ('Mère Paillarde', 10376),
 ('Seven Seas Imports', 10377),
 ('Folk och fä HB', 10378),
 ('Que Delícia', 10379),
 ('Hungry Owl All-Night Grocers', 10380),
 ('LILA-Supermercado', 10381),
 ('Ernst Handel', 10382),
 ('Around the Horn', 10383),
 ('Berglunds snabbköp', 10384),
 ('Split Rail Beer & Ale', 10385),
 ('Familia Arquibaldo', 10386),
 ('Santé Gourmet', 10387),
 ('Seven Seas Imports', 10388),
 ('Bottom-Dollar Marketse', 10389),
 ('Ernst Handel', 10390),
 ('Drachenblut Delikatessend', 10391),
 ('Piccolo und mehr', 10392),
 ('Save-a-lot Markets', 10393),
 ('Hungry Coyote Import Store', 10394),
 ('HILARIÓN-Abastos', 10395),
 ('Frankenversand', 10396),
 ('Princesa Isabel Vinhoss', 10397),
 ('Save-a-lot Markets', 10398),
 ('Vaffeljernet', 10399),
 ('Eastern Connection', 10400),
 ('Rattlesnake Canyon Grocery', 10401),
 ('Ernst Handel', 10402),
 ('Ernst Handel', 10403),
 ('Magazzini Alimentari Riuniti', 10404),
 ('LINO-Delicateses', 10405),
 ('Queen Cozinha', 10406),
 ('Ottilies Käseladen', 10407),
 ('Folies gourmandes', 10408),
 ('Océano Atlántico Ltda.', 10409),
 ('Bottom-Dollar Marketse', 10410),
 ('Bottom-Dollar Marketse', 10411),
 ('Wartian Herkku', 10412),
 ("La maison d''Asie", 10413),
 ('Familia Arquibaldo', 10414),
 ('Hungry Coyote Import Store', 10415),
 ('Wartian Herkku', 10416),
 ('Simons bistro', 10417),
 ('QUICK-Stop', 10418),
 ('Richter Supermarkt', 10419),
 ('Wellington Importadora', 10420),
 ('Que Delícia', 10421),
 ('Franchi S.p.A.', 10422),
 ('Gourmet Lanchonetes', 10423),
 ('Mère Paillarde', 10424),
 ("La maison d''Asie", 10425),
 ('Galería del gastrónomo', 10426),
 ('Piccolo und mehr', 10427),
 ('Reggiani Caseifici', 10428),
 ('Hungry Owl All-Night Grocers', 10429),
 ('Ernst Handel', 10430),
 ('Bottom-Dollar Marketse', 10431),
 ('Split Rail Beer & Ale', 10432),
 ('Princesa Isabel Vinhoss', 10433),
 ('Folk och fä HB', 10434),
 ('Consolidated Holdings', 10435),
 ('Blondel père et fils', 10436),
 ('Wartian Herkku', 10437),
 ('Toms Spezialitäten', 10438),
 ('Mère Paillarde', 10439),
 ('Save-a-lot Markets', 10440),
 ('Old World Delicatessen', 10441),
 ('Ernst Handel', 10442),
 ('Reggiani Caseifici', 10443)]

In [ ]:
sql = """SELECT A.CustomerName AS CustomerName1, B.CustomerName AS CustomerName2, A.City
         FROM Customers A, Customers B
         WHERE A.CustomerID <> B.CustomerID
         AND A.City = B.City 
         ORDER BY A.City;"""
sendQuery(sql)

inner join은 각 테이블에 column중 select하는 column이 있는 경우에만 row를 합쳐서 가져오고, outer join의 경우는 칼럼이 없더라도 LEFT RIGHT 조건에 부합하기만 한다면 row를 합쳐서 보여준다. SELF JOIN같은 경우엔 JOIN 명령을 안쓰더라도 작동한다.

## UNION

SELECT해서 나온 결과를 이어붙여주는 문법이다. 제한사항은 다음과 같다:

* 각 SELECT문의 COLUMN개수는 같아야 한다.
* 각 COLUMN은 데이터 타입이 같아야 한다.
* SELECT문 속 고르는 COLUMN의 순서 또한 같아야 한다.

이렇게 하면 SELECT결과를 합쳐준다고 한다

## GROUP BY

pandas의 groyp by와 동일하게 데이터중 일부 column이 같은 부분을 모아서 각 부분마다 데이터 처리 함수를 실행한 뒤, 다시 모아서 보여주는 명령어이다.

In [ ]:
sql = """SELECT COUNT(CustomerID), Country
         FROM Customers
         GROUP BY Country;"""
sendQuery(sql)

위 함수의 실행 결과는 각 국적의 사람들의 수를 집계한 데이터가 나오게 된다. 조금 더 복잡하게는 다음과 같이 JOIN과 엮어서 쓸 수 있다.

In [ ]:
sql = """SELECT Shippers.ShipperName, COUNT(Orders.OrderID) AS NumberOfOrders FROM Orders
         LEFT JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID
         GROUP BY ShipperName;"""
sendQuery(sql)

## HAVING

WHERE문 안에서는 추가적인 데이터 처리 함수를 쓰지 못하기 때문에 HAVING을 써서 이를 해결한다.

In [3]:
sql = """SELECT COUNT(CustomerID), Country
         FROM Customers
         GROUP BY Country
         HAVING COUNT(CustomerID) > 5;
"""
sendQuery(sql)

[(9, 'Brazil'), (11, 'France'), (11, 'Germany'), (7, 'UK'), (13, 'USA')]

In [5]:
sql = """SELECT COUNT(CustomerID), Country
         FROM Customers
         GROUP BY Country
         HAVING COUNT(CustomerID) > 5
         ORDER BY COUNT(CustomerID) DESC;
"""
sendQuery(sql)

[(13, 'USA'), (11, 'Germany'), (11, 'France'), (9, 'Brazil'), (7, 'UK')]

위의 두 쿼리는 국가당 계정이 5개 있는 나라와 계정 수를 출력하는 쿼리였다. ORDER BY DESCENT로 역순 정렬도 하는 보습을 확인할 수 있다.

## EXISTS
서브 쿼리문의 결과에서 아이템이 존재하면 참이 된다.

In [6]:
sql = """SELECT SupplierName
FROM Suppliers
WHERE EXISTS (SELECT ProductName FROM Products WHERE Products.SupplierID = Suppliers.supplierID AND Price < 20);
"""
sendQuery(sql)

[('Exotic Liquid',),
 ('New Orleans Cajun Delights',),
 ('Tokyo Traders',),
 ("Mayumi's",),
 ('Pavlova, Ltd.',),
 ('Specialty Biscuits, Ltd.',),
 ('PB Knäckebröd AB',),
 ('Refrescos Americanas LTDA',),
 ('Heli Süßwaren GmbH & Co. KG',),
 ('Plutzer Lebensmittelgroßmärkte AG',),
 ('Formaggi Fortini s.r.l.',),
 ('Norske Meierier',),
 ('Bigfoot Breweries',),
 ('Svensk Sjöföda AB',),
 ('Aux joyeux ecclésiastiques',),
 ('New England Seafood Cannery',),
 ('Leka Trading',),
 ('Lyngbysild',),
 ('Zaanse Snoepfabriek',),
 ('Karkki Oy',),
 ("G'day, Mate",),
 ('Ma Maison',),
 ('Pasta Buttini s.r.l.',),
 ('Escargots Nouveaux',)]

In [109]:
sql = 
sendQuery(sql)

no such column: Suppliers.supplierID

위의 코드에서는 마트에 제푸믈 공갑하는 사업자 중 20불보다 싼 물건을 납품하는 업자들의 명단이다.

# ANY and ALL

이름 그대로 서브쿼리에 조건에 맞는 값이 하나라도/모두가 온다면 TRUE를 반환한다.

In [10]:
sql = """SELECT ProductName
         FROM Products
         WHERE ProductID = ANY
         (SELECT ProductID
         FROM OrderDetails
         WHERE Quantity = 10);
"""
sendQuery(sql)

near "SELECT": syntax error

In [11]:
sql = """SELECT ProductName
         FROM Products
         WHERE ProductID = ANY
         (SELECT ProductID
         FROM OrderDetails
         WHERE Quantity > 1000);
"""
sendQuery(sql)

near "SELECT": syntax error

In [12]:
sql = """SELECT ProductName
         FROM Products
         WHERE ProductID = ALL
         (SELECT ProductID
         FROM OrderDetails
         WHERE Quantity = 10);"""
sendQuery(sql)

near "ALL": syntax error

ALL과 ANY는 작동하지 않았다.

# SELECT INTO
해당 구문은 새로운 테이블에 고른 데이터를 넣을려고 사용한다

In [6]:
sql = "SELECT * INTO CustomersBackup2017 FROM Customers;"
sendQuery(sql)
sql = "SELECT * FROM CustomersBackup2017"
sendQuery(sql)

near "INTO": syntax error
no such table: CustomersBackup2017

실행이 안되고 있는 모습을 보여준다

# INSERT INTO SELECT
뒤에서 SELECT에 의해 선택된 데이터를 INSERT INTO 뒤에 오는 테이블에 넣는다.

In [ ]:
sql = """INSERT INTO Customers (CustomerName, City, Country)
         SELECT SupplierName, City, Country FROM Suppliers;"""
sendQuery(sql)
sql = "SELECT * FROM Customers"
sendQuery(sql)

맨 뒤에 서플라이어 테이블로붜 일부가 커스토머에 추가된 것을 확인할 수 있다.

# CASE
c 언어의 case문처럼 여러개의 조건을 다루기 위해 사용한다.

In [ ]:
sql = """SELECT OrderID, Quantity,
         CASE
             WHEN Quantity > 30 THEN 'The quantity is greater than 30'
             WHEN Quantity = 30 THEN 'The quantity is 30'
             ELSE 'The quantity is under 30'    
         END AS QuantityText
         FROM OrderDetails;"""
sendQuery(sql)

In [ ]:
sql = """SELECT CustomerName, City, Country
         FROM Customers
         ORDER BY
         (CASE
             WHEN City IS NULL THEN Country
             ELSE City
         END);
"""
sendQuery(sql)

case문을 이용하여 여타 프로그래밍 언어의 if 문과도 같은 사용을 할 수 있다.

# NULL
NULL값이 왔을 때 다른 값으로 처리하는 함수를 다룬다.

In [10]:
sql = """SELECT ProductName, UnitPrice * (UnitsInStock + IFNULL(UnitsOnOrder, 0))
         FROM Products;"""
sendQuery(sql)

no such column: UnitPrice

In [11]:
sql = """SELECT ProductName, UnitPrice * (UnitsInStock + ISNULL(UnitsOnOrder, 0))
         FROM Products;"""
sendQuery(sql)

near "ISNULL": syntax error

In [12]:
sql = """SELECT ProductName, UnitPrice * (UnitsInStock + IIF(IsNull(UnitsOnOrder), 0, UnitsOnOrder))
         FROM Products;"""
sendQuery(sql)

near "IsNull": syntax error

In [13]:
sql = """SELECT ProductName, UnitPrice * (UnitsInStock + NVL(UnitsOnOrder, 0))
         FROM Products;"""
sendQuery(sql)

no such column: UnitPrice

In [14]:
sql = """SELECT ProductName, UnitPrice * (UnitsInStock + COALESCE(UnitsOnOrder, 0))
         FROM Products;"""
sendQuery(sql)

no such column: UnitPrice

뭔가 작동은 잘 안하지만 sqlite3에서는 IFNULL, NVM, COALESCE 함수만 작동하는것을 확인할 수 있었다.

# Stored Procedures
프로그래밍 언어의 함수처럼, 자주 사용하는 쿼리문이 있다면, 저장해서 사용할 수 있는 기능이다.

In [17]:
sql = """CREATE PROCEDURE SelectAllCustomers
         AS
         SELECT * FROM Customers
         GO;
"""
sendQuery(sql)

sql = "EXEC SelectAllCustormer"
sendQuery(sql)

near "PROCEDURE": syntax error
near "EXEC": syntax error

그러나 sqlite3에서는 작동하지 않는다. 댜음과 같이 매개변수를 이용할 수도 있다.

In [18]:
sql = """CREATE PROCEDURE SelectAllCustomers @City nvarchar(30), @PostalCode nvarchar(10)
         AS
         SELECT * FROM Customers WHERE City = @City AND PostalCode = @PostalCode
         GO;"""
sendQuery(sql)

sql = "EXEC SelectAllCustomers @City = 'London', @PostalCode = 'WA1 1DP'"
sendQuery(sql)

near "PROCEDURE": syntax error
near "EXEC": syntax error

아무튼 작동하지는 않지만 위와같은 문법으로 사용할 수 있다.

# Comments
"--" 대쉬 두개를 그은 후에 주석을 달 수 있다.

# Operators
Sql에서 사용할 수 있는 많은 연산자가 있다. + - * / % 와 같이 기본 사칙연산과 관련된 연산자, & | ^ 와 같이 c에서 비트 단위로 연산해주는 연산자, = > < >= <= <> 연산자와 같이 조건에 관한 연산자를 쓸 수 있다. c와 다른 점은 c의 == 대신에 =, c의 != 대신에 <>를 쓴다는 점이다.

계속해서 += -= *= /- %= &= ^-=, |*= 연산자가 있는데, 다른건 c와 같지만 ^-=, |*=연산자 사용에 주의하자. 각각 bitwise xor equals, bitwise OR equals이다.

마지막으로 지금까지 봤던 문자열 형식의 연산자도 연산자이다. ALL, AND, ANY, BETWEEN, EXISTS, IN, LIKE, NOT, OR, SOME이 있다.

# Database Operating
데이터베이스를 다루는 함수들이다.

## CREATE DATABASE
데이터베이스를 만든다.

In [19]:
sql = "CREATE DATABASE testDB"
sendQuery(sql)

near "DATABASE": syntax error

## DROP DATABASE
데이터베이스를 지운다.

In [20]:
sql = "DROP DATABASE testDB"
sendQuery(sql)

near "DATABASE": syntax error

## BACKUP DATABASE
데이터베이스를 파일로 출력한다.

In [22]:
sql = """BACKUP DATABASE testDB
         TO DISK = "./testDB.bak"
"""
sendQuery(sql)

near "BACKUP": syntax error

In [23]:
sql = """BACKUP DATABASE testDB
         TO DISK = "./testDB.bak"
         WITH DIFFERENTIAL"""
sendQuery(sql)

near "BACKUP": syntax error

with differential 옵션을 붙이면 기록 시간은 제외하고 저장된다.

위의 세 함수는 실행이 되지 않지만 아무튼 저런 기능이 있다고 한다.

# Table Operating
데이터베이스 내부의 테이블을 다루는 명령어를 다룬다.

## CREATE TABLE
새로운 테이블을 만든다.

In [ ]:
sql = """CREATE TABLE Persons (
         PersonID int,
         LastName varchar(255),
         FirstName varchar(255),
         Address varchar(255),
         City varchar(255) 
         );
      """
sendQuery(sql)

In [ ]:
sql = """CREATE TABLE TestTable AS
         SELECT customername, contactname
         FROM customers;
      """
sendQuery(sql)
sql = "SELECT * FROM TestTable"
sendQuery(sql)

AS SELECT를 이용하여 새로운 테이블을 만들 수도 있다. 이때는, 선택된 column에 데이터가 있다면, 해당 데이터도 같이 복사된다.

## DROP TABLE
테이블을 삭제한다.

In [27]:
sql = "DROP TABLE Persons"
sendQuery(sql)

[]

In [29]:
sql = "TRUNCATE TABLE TestTable"
sendQuery(sql)
sql = "SELECT * FROM TestTable"
sendQuery(sql)
sql = "DROP TABLE TestTable"
sendQuery(sql)

near "TRUNCATE": syntax error

[]

TRUNCATE TABLE 함수를 이용하여 테이블 내부 데이터를 삭제할 수 있다고 하는데 삭제가 안된다. 아무래도 DROP * FROM table을 사용해야 할 것 같다.

## ALTER TABLE
기존 테이블에 열을 추가하거나 삭제하기 위해 사용한다. 그 외에도 제약조건을 걸거나 삭제하는데에도 사용할 수 있다.

In [34]:
sql = """ALTER TABLE Customers
         ADD Email varchar(255);"""
sendQuery(sql)
sql = "SELECT * FROM Customers LIMIT 1"
print(sendQuery(sql))
sql = """ALTER TABLE Customers
         DROP COLUMN Email;"""
sendQuery(sql)
sql = "SELECT * FROM Customers LIMIT 1"
print(sendQuery(sql))

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany', None)]
[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')]

In [37]:
sql = "ALTER TABLE Customers RENAME COLUMN City to city"
sendQuery(sql)
sql = "SELECT city FROM Customers LIMIT 1"
print(sendQuery(sql))
sql = "ALTER TABLE Customers RENAME COLUMN City to city"
sendQuery(sql)

[('Berlin',)]

[]

In [38]:
sql = """ALTER TABLE table_name
         MODIFY COLUMN column_name datatype;
"""
# or
sql = """ALTER TABLE table_name
         MODIFY column_name datatype;
"""

위와 같은 방법으로 column의 데이터 형식을 바꿀 수 있다.

# Constrains
table을 만들 때, 각 column의 제약 조건을 설정할 수 있다. 제약조건으로는 다음과 같이 걸 수 있다.

* NOT NULL: NULL값이 데이터로 올 수 없음.
* UNIQUE: 데이터가 중복될 수 없음
* PRIMARY KEY (NOT NULL): 해당 column의 데이터로 테이블의 각 행을 식별함. UNIQUE해야한다.
* FOREIGN KEY: 테이블 간 링크를 파괴하는 작업을 방지한다.
* CHECK: 열의 값이 특정 조건을 만족하는지 확인한다.
* DEFAULT: 값이 지정되지 않은 경우 열에 대한 기본값을 설정한다.
* CREATE INDEX: 데이터베이스에서 매우 빠르게 데이터를 생성하고 검색하는데 사용됨.

## NOT NULL

In [22]:
sql = """
    CREATE TABLE TestTable (
        ID int NOT NULL,
        LastName varchar(255) NOT NULL,
        FirstName varchar(255) NOT NULL,
        Age int
    );
"""
sendQuery(sql)
sql = """INSERT INTO TestTable(ID, LastName, FirstName, Age)
         VALUES (?,?,?,?)"""
data = [[1,"kim","babo", 26], [2,"Lee","Jeongsang", 7], [3, "Park", "Daegi", 40]]
sendQueryWithData(sql, data)
sql = """INSERT INTO TestTable(ID, LastName, FirstName)
         VALUES (4,"test", "no age")"""
sendQuery(sql)
sql = """INSERT INTO TestTable(ID, LastName)
         VALUES (4,"No First name")"""
sendQuery(sql)
sql = "SELECT * FROM TestTable"
print(sendQuery(sql))
#sql = "DROP TABLE TestTable"
#sendQuery(sql)

NOT NULL constraint failed: TestTable.FirstName
[(1, 'kim', 'babo', 26), (2, 'Lee', 'Jeongsang', 7), (3, 'Park', 'Daegi', 40), (4, 'test', 'no age', None)]

## UNIQUE

In [25]:
#sql = """INSERT INTO TestTable(ID, LastName, FirstName)
#         VALUES (4,"test", "no unique id")"""
#sendQuery(sql)
#sql = "ALTER TABLE TestTable ADD CONSTRAINT UNIQUE (ID)"
sql = "ALTER TABLE TestTable ADD CONSTRAINT UC_Person UNIQUE (ID, LastName)"
sendQuery(sql)

near "CONSTRAINT": syntax error

안된다... 테이블을 삭제하고 다시 생성해서 시도해 본다.

In [27]:
sql = "DROP TABLE TestTable"
sendQuery(sql)

sql = """
    CREATE TABLE TestTable (
        ID int NOT NULL,
        LastName varchar(255) NOT NULL,
        FirstName varchar(255) NOT NULL,
        Age int,
        UNIQUE (ID)
    );
"""
sendQuery(sql)
sql = """INSERT INTO TestTable(ID, LastName, FirstName, Age)
         VALUES (?,?,?,?)"""
data = [[1,"kim","babo", 26], [2,"Lee","Jeongsang", 7], [3, "Park", "Daegi", 40]]
sendQueryWithData(sql, data)
sql = """INSERT INTO TestTable(ID, LastName, FirstName)
         VALUES (4,"test", "no age")"""
sendQuery(sql)
sql = """INSERT INTO TestTable(ID, LastName, FirstName)
         VALUES (4,"No Unique", "ID")"""
sendQuery(sql)
sql = "SELECT * FROM TestTable"
print(sendQuery(sql))

UNIQUE constraint failed: TestTable.ID
[(1, 'kim', 'babo', 26), (2, 'Lee', 'Jeongsang', 7), (3, 'Park', 'Daegi', 40), (4, 'test', 'no age', None)]

## PRIMARY KEY

In [88]:
sql = "DROP TABLE TestTable"
sendQuery(sql)

sql = """
    CREATE TABLE TestTable (
        ID integer NOT NULL PRIMARY KEY,
        LastName varchar(255) NOT NULL,
        FirstName varchar(255) NOT NULL,
        Age integer,
        UNIQUE (ID)
    );
"""
sendQuery(sql)
sql = """INSERT INTO TestTable(ID, LastName, FirstName, Age)
         VALUES (?,?,?,?)"""
data = [[1,"kim","babo", 26], [2,"Lee","Jeongsang", 7], [3, "Park", "Daegi", 40]]
sendQueryWithData(sql, data)
sql = """INSERT INTO TestTable(ID, LastName, FirstName)
         VALUES (4,"test", "no age")"""
sendQuery(sql)
sql = """INSERT INTO TestTable(ID, LastName, FirstName)
         VALUES (4,"No Unique", "ID")"""
sendQuery(sql)
sql = "SELECT * FROM TestTable"
print(sendQuery(sql))

UNIQUE constraint failed: TestTable.ID
[(1, 'kim', 'babo', 26), (2, 'Lee', 'Jeongsang', 7), (3, 'Park', 'Daegi', 40), (4, 'test', 'no age', None)]

UNIQUE 키워드를 붙이지 않아도 자동으로 중복을 파악해 준다.

## FOREIGN KEY

In [89]:
sql = "DROP TABLE TestTable2"
sendQuery(sql)
sql = "PRAGMA foreign_keys = 1;"
sendQuery(sql)
sql = """
    CREATE TABLE TestTable2 (
        OrderID integer NOT NULL,
        OrderNum integer NOT NULL,
        PersonID int,
        PRIMARY KEY (OrderID),
        CONSTRAINT FK_PeronOrder FOREIGN KEY (PersonID)
        REFERENCES TestTable(ID)
    );
"""
sendQuery(sql)
sql = """INSERT INTO TestTable2(OrderID, OrderNum, PersonID)
         VALUES (1, 13245, 1)"""
sendQuery(sql)
sql = """INSERT INTO TestTable2(OrderID, OrderNum, PersonID)
         VALUES (2, 13245, 10000)"""
sendQuery(sql)
sql = "SELECT * FROM TestTable2"
sendQuery(sql)

no such table: TestTable2

[(1, 13245, 1), (2, 13245, 10000)]

원리는 TestTable의 ID 외의 값이 PersonID 값으로 오면 테이블에 INSERT가 되면 안되는데 된다... 무엇이 문제인지 모르겠다. 마지막으로 TestTable을 지운다.

In [56]:
sql = ["DROP TABLE TestTable","DROP TABLE TestTable2"]
[sendQuery(s) for s in sql]

no such table: TestTable2

[[], None]

## CHECK

In [87]:
sql = "DROP TABLE TestTable"
sendQuery(sql)

sql = """
    CREATE TABLE TestTable (
        ID integer NOT NULL PRIMARY KEY,
        LastName varchar(255) NOT NULL,
        FirstName varchar(255) NOT NULL,
        Age integer,
        CreatedAt date DEFAULT (date('now'))
    );
"""
sendQuery(sql)
sql = """INSERT INTO TestTable(ID, LastName, FirstName, Age)
         VALUES (?,?,?,?)"""
data = [[1,"kim","babo", 26], [2,"Lee","Jeongsang", 67], [3, "Park", "Daegi", 40]]
sendQueryWithData(sql, data)
sql = """INSERT INTO TestTable(ID, LastName, FirstName, Age)
         VALUES (1,"test", "no age", 4)"""
sendQuery(sql)
sql = """INSERT INTO TestTable(ID, LastName, FirstName, Age)
         VALUES (4,"No Unique", "ID", 18)"""
sendQuery(sql)

sql = "SELECT * FROM TestTable"
print(sendQuery(sql))

UNIQUE constraint failed: TestTable.ID
[(1, 'kim', 'babo', 26, '2025-01-08'), (2, 'Lee', 'Jeongsang', 67, '2025-01-08'), (3, 'Park', 'Daegi', 40, '2025-01-08'), (4, 'No Unique', 'ID', 18, '2025-01-08')]

해당 필드의 값이 비었을 때 자동으로 채워주는 조건이다.

## CREATE INDEX
복수개의 Column이 허용된다.

In [73]:
sql = "CREATE INDEX idx_lastname ON TestTable(ID);"
sendQuery(sql)

[]

인덱스는 데이터베이스를 빠르게 탐색하게 해준다고 한다. 사용자는 인덱스를 볼 수 없으며, 인덱스가 있는 테이블은 업데이트시 시간이 더 많이 걸림에 주의해야 한다.

## AUTO INCREMENT
테이블 생성 시, 자동으로 증가하는 필드로 설정한다.

In [91]:
sql = "DROP TABLE TestTable"
sendQuery(sql)

sql = """
    CREATE TABLE TestTable (
        Id integer PRIMARY KEY AUTOINCREMENT,
        LastName varchar(255) NOT NULL,
        FirstName varchar(255) NOT NULL,
        Age int,
        CreatedAt date DEFAULT (datetime('now'))
    );
"""
sendQuery(sql)
sql = """INSERT INTO TestTable(LastName, FirstName, Age)
         VALUES (?,?,?)"""
data = [["kim","babo", 26], ["Lee","Jeongsang", 67], ["Park", "Daegi", 40]]
sendQueryWithData(sql, data)
sql = """INSERT INTO TestTable(LastName, FirstName, Age)
         VALUES ("test", "no age", 4)"""
sendQuery(sql)
sql = """INSERT INTO TestTable(Id, LastName, FirstName, Age)
         VALUES (1,"No Unique", "ID", 18)"""
sendQuery(sql)


sql = "SELECT * FROM TestTable"
print(sendQuery(sql))

UNIQUE constraint failed: TestTable.Id
[(1, 'kim', 'babo', 26, '2025-01-08 02:37:28'), (2, 'Lee', 'Jeongsang', 67, '2025-01-08 02:37:28'), (3, 'Park', 'Daegi', 40, '2025-01-08 02:37:28'), (4, 'test', 'no age', 4, '2025-01-08 02:37:28')]

# Dates
날짜를 다룬다.

MySQL에서의 형식은 다음과 같다:

* DATE: YYYY-MM-DD
* DATETIME: YYYY-MM-DD HH:MI:SS
* TIMESTAMP: YYYY-MM-DD HH:MI:SS
* YEAR: YYYY 혹은 YY

SQL Server에서는 다음과 같다:

* DATE: YYYY-MM-DD
* DATETIME: YYYY-MM-DD HH:MI:SS
* SMALLDATETIME: YYYY-MM-DD HH:MI:SS
* TIMESTAMP: 고유 번호

홈페이지에 적힌 팁으로는 꼭 필요한 경우가 아니라면 날짜에 시간 구성요소를 사용하지 말라고 한다. 하루 단위로 조작하는 데이터가 많지 시/분/초 단위로 조작하는 데이터가 많지 않아서 그런 것 같다. 그것이 아니더라도 일자까지는 비교를 잘 해주는 것 같다.

# VIEW
view는 이름을 재명명한 듯한 느낌이다. 원하는 테이블에서 필요한 데이터만을 모아 뷰로 설정할 수 있다. 원래 테이블을 업데이트 하면 뷰도 자동으로 업데이트 된다고 한다.

In [92]:
sql = """
    CREATE VIEW [Brazil Customers] AS
    SELECT CustomerName, ContactName
    FROM Customers
    WHERE Country = 'Brazil';
"""
sendQuery(sql)
sql = "SELECT * FROM [Brazil Customers]"
sendQuery(sql)

[('Comércio Mineiro', 'Pedro Afonso'),
 ('Familia Arquibaldo', 'Aria Cruz'),
 ('Gourmet Lanchonetes', 'André Fonseca'),
 ('Hanari Carnes', 'Mario Pontes'),
 ('Que Delícia', 'Bernardo Batista'),
 ('Queen Cozinha', 'Lúcia Carvalho'),
 ('Ricardo Adocicados', 'Janete Limeira'),
 ('Tradição Hipermercados', 'Anabela Domingues'),
 ('Wellington Importadora', 'Paula Parente')]

CREATE OR REPLACE 문으로 재구성 할 수 있다.

In [96]:
sql = """
    CREATE OR REPLACE VIEW [Brazil Customers] AS
    SELECT CustomerName, ContactName, City
    FROM Customers
    WHERE Country = 'Brazil';
"""
sendQuery(sql)
sql = "SELECT * FROM [Brazil Customers]"
sendQuery(sql)

near "OR": syntax error

[('Comércio Mineiro', 'Pedro Afonso'),
 ('Familia Arquibaldo', 'Aria Cruz'),
 ('Gourmet Lanchonetes', 'André Fonseca'),
 ('Hanari Carnes', 'Mario Pontes'),
 ('Que Delícia', 'Bernardo Batista'),
 ('Queen Cozinha', 'Lúcia Carvalho'),
 ('Ricardo Adocicados', 'Janete Limeira'),
 ('Tradição Hipermercados', 'Anabela Domingues'),
 ('Wellington Importadora', 'Paula Parente')]

잘 안된다...

In [97]:
sql = "DROP VIEW [Brazil Customers]"
sendQuery(sql)

[]

# Injection

인젝션은 해킹 기술이며 데이터 베이스를 파괴하거나 악성코드를 삽입할 수 있다.

가장 쉬운 방법은 사용자 입력을 그대로 쿼리문으로 사용하는 것이다. 예를 들면 다음과 같다:

In [103]:
userId = input("press user id: ")
sql = "SELECT * FROM Customers WHERE CustomerName = "+userId
sendQuery(sql)

near "OR": syntax error

사용자 입력에서 아무 문자열을 넣고 "OR 1 = 1"을 넣으면 테이블의 모든 정보를 볼 수 있다.

"" OR 1 = 1

을 입력해보자

마찬가지로 다음의 쿼리문도 위험하다.

In [105]:
customerName = input("press user name: ")
customerCity = input("press user living city: ")
sql = 'SELECT * FROM Customers WHERE CustomerName ="' + customerName + '" AND City ="' + customerCity + '"'
sendQuery(sql)

[(1,
  'Alfreds Futterkiste',
  'Maria Anders',
  'Obere Str. 57',
  'Berlin',
  '12209',
  'Germany'),
 (2,
  'Ana Trujillo Emparedados y helados',
  'Ana Trujillo',
  'Avda. de la Constitución 2222',
  'México D.F.',
  '5021',
  'Mexico'),
 (3,
  'Antonio Moreno Taquería',
  'Antonio Moreno',
  'Mataderos 2312',
  'México D.F.',
  '5023',
  'Mexico'),
 (4,
  'Around the Horn',
  'Thomas Hardy',
  '120 Hanover Sq.',
  'London',
  'WA1 1DP',
  'UK'),
 (5,
  'Berglunds snabbköp',
  'Christina Berglund',
  'Berguvsvägen 8',
  'Luleå',
  'S-958 22',
  'Sweden'),
 (6,
  'Blauer See Delikatessen',
  'Hanna Moos',
  'Forsterstr. 57',
  'Mannheim',
  '68306',
  'Germany'),
 (7,
  'Blondel père et fils',
  'Frédérique Citeaux',
  '24, place Kléber',
  'Strasbourg',
  '67000',
  'France'),
 (8,
  'Bólido Comidas preparadas',
  'Martín Sommer',
  'C/ Araquil, 67',
  'Madrid',
  '28023',
  'Spain'),
 (9,
  "Bon app''",
  'Laurence Lebihans',
  '12, rue des Bouchers',
  'Marseille',
  '13008',
  'France'),
 (10,
  'Bottom-Dollar Marketse',
  'Elizabeth Lincoln',
  '23 Tsawassen Blvd.',
  'Tsawassen',
  'T2F 8M4',
  'Canada'),
 (11,
  "B''s Beverages",
  'Victoria Ashworth',
  'Fauntleroy Circus',
  'London',
  'EC2 5NT',
  'UK'),
 (12,
  'Cactus Comidas para llevar',
  'Patricio Simpson',
  'Cerrito 333',
  'Buenos Aires',
  '1010',
  'Argentina'),
 (13,
  'Centro comercial Moctezuma',
  'Francisco Chang',
  'Sierras de Granada 9993',
  'México D.F.',
  '5022',
  'Mexico'),
 (14,
  'Chop-suey Chinese',
  'Yang Wang',
  'Hauptstr. 29',
  'Bern',
  '3012',
  'Switzerland'),
 (15,
  'Comércio Mineiro',
  'Pedro Afonso',
  'Av. dos Lusíadas, 23',
  'São Paulo',
  '05432-043',
  'Brazil'),
 (16,
  'Consolidated Holdings',
  'Elizabeth Brown',
  'Berkeley Gardens 12 Brewery',
  'London',
  'WX1 6LT',
  'UK'),
 (17,
  'Drachenblut Delikatessend',
  'Sven Ottlieb',
  'Walserweg 21',
  'Aachen',
  '52066',
  'Germany'),
 (18,
  'Du monde entier',
  'Janine Labrune',
  '67, rue des Cinquante Otages',
  'Nantes',
  '44000',
  'France'),
 (19,
  'Eastern Connection',
  'Ann Devon',
  '35 King George',
  'London',
  'WX3 6FW',
  'UK'),
 (20,
  'Ernst Handel',
  'Roland Mendel',
  'Kirchgasse 6',
  'Graz',
  '8010',
  'Austria'),
 (21,
  'Familia Arquibaldo',
  'Aria Cruz',
  'Rua Orós, 92',
  'São Paulo',
  '05442-030',
  'Brazil'),
 (22,
  'FISSA Fabrica Inter. Salchichas S.A.',
  'Diego Roel',
  'C/ Moralzarzal, 86',
  'Madrid',
  '28034',
  'Spain'),
 (23,
  'Folies gourmandes',
  'Martine Rancé',
  '184, chaussée de Tournai',
  'Lille',
  '59000',
  'France'),
 (24,
  'Folk och fä HB',
  'Maria Larsson',
  'Åkergatan 24',
  'Bräcke',
  'S-844 67',
  'Sweden'),
 (25,
  'Frankenversand',
  'Peter Franken',
  'Berliner Platz 43',
  'München',
  '80805',
  'Germany'),
 (26,
  'France restauration',
  'Carine Schmitt',
  '54, rue Royale',
  'Nantes',
  '44000',
  'France'),
 (27,
  'Franchi S.p.A.',
  'Paolo Accorti',
  'Via Monte Bianco 34',
  'Torino',
  '10100',
  'Italy'),
 (28,
  'Furia Bacalhau e Frutos do Mar',
  'Lino Rodriguez',
  'Jardim das rosas n. 32',
  'Lisboa',
  '1675',
  'Portugal'),
 (29,
  'Galería del gastrónomo',
  'Eduardo Saavedra',
  'Rambla de Cataluña, 23',
  'Barcelona',
  '8022',
  'Spain'),
 (30,
  'Godos Cocina Típica',
  'José Pedro Freyre',
  'C/ Romero, 33',
  'Sevilla',
  '41101',
  'Spain'),
 (31,
  'Gourmet Lanchonetes',
  'André Fonseca',
  'Av. Brasil, 442',
  'Campinas',
  '04876-786',
  'Brazil'),
 (32,
  'Great Lakes Food Market',
  'Howard Snyder',
  '2732 Baker Blvd.',
  'Eugene',
  '97403',
  'USA'),
 (33,
  'GROSELLA-Restaurante',
  'Manuel Pereira',
  '5ª Ave. Los Palos Grandes',
  'Caracas',
  '1081',
  'Venezuela'),
 (34,
  'Hanari Carnes',
  'Mario Pontes',
  'Rua do Paço, 67',
  'Rio de Janeiro',
  '05454-876',
  'Brazil'),
 (35,
  'HILARIÓN-Abastos',
  'Carlos Hernández',
  'Carrera 22 con Ave. Carlos Soublette #8-35',
  'San Cristóbal',
  '5022',
  'Venezuela'),
 (36,
  'Hungry Coyote Import Store',
  'Yoshi Latimer',
  'City Center Plaza 516 Main St.',
  'Elgin',
  '97827',
  'USA'),
 (37,
  'Hungry Owl All-Night Grocers',
  'Patricia McKenna',
  '8 Johnstown Road',
  'Cork',
  '',
  'Ireland'),
 (38,
  'Island Trading',
  'Helen Bennett',
  'Garden House Crowther Way',
  'Cowes',
  'PO31 7PJ',
  'UK'),
 (39,
  'Königlich Essen',
  'Philip Cramer',
  'Maubelstr. 90',
  'Brandenburg',
  '14776',
  'Germany'),
 (40,
  "La corne d''abondance",
  'Daniel Tonini',
  "67, avenue de l''Europe",
  'Versailles',
  '78000',
  'France'),
 (41,
  "La maison d''Asie",
  'Annette Roulet',
  '1 rue Alsace-Lorraine',
  'Toulouse',
  '31000',
  'France'),
 (42,
  'Laughing Bacchus Wine Cellars',
  'Yoshi Tannamuri',
  '1900 Oak St.',
  'Vancouver',
  'V3F 2K1',
  'Canada'),
 (43,
  'Lazy K Kountry Store',
  'John Steel',
  '12 Orchestra Terrace',
  'Walla Walla',
  '99362',
  'USA'),
 (44,
  'Lehmanns Marktstand',
  'Renate Messner',
  'Magazinweg 7',
  'Frankfurt a.M.',
  '60528',
  'Germany'),
 (45,
  "Let''s Stop N Shop",
  'Jaime Yorres',
  '87 Polk St. Suite 5',
  'San Francisco',
  '94117',
  'USA'),
 (46,
  'LILA-Supermercado',
  'Carlos González',
  'Carrera 52 con Ave. Bolívar #65-98 Llano Largo',
  'Barquisimeto',
  '3508',
  'Venezuela'),
 (47,
  'LINO-Delicateses',
  'Felipe Izquierdo',
  'Ave. 5 de Mayo Porlamar',
  'I. de Margarita',
  '4980',
  'Venezuela'),
 (48,
  'Lonesome Pine Restaurant',
  'Fran Wilson',
  '89 Chiaroscuro Rd.',
  'Portland',
  '97219',
  'USA'),
 (49,
  'Magazzini Alimentari Riuniti',
  'Giovanni Rovelli',
  'Via Ludovico il Moro 22',
  'Bergamo',
  '24100',
  'Italy'),
 (50,
  'Maison Dewey',
  'Catherine Dewey',
  'Rue Joseph-Bens 532',
  'Bruxelles',
  'B-1180',
  'Belgium'),
 (51,
  'Mère Paillarde',
  'Jean Fresnière',
  '43 rue St. Laurent',
  'Montréal',
  'H1J 1C3',
  'Canada'),
 (52,
  'Morgenstern Gesundkost',
  'Alexander Feuer',
  'Heerstr. 22',
  'Leipzig',
  '4179',
  'Germany'),
 (53,
  'North/South',
  'Simon Crowther',
  'South House 300 Queensbridge',
  'London',
  'SW7 1RZ',
  'UK'),
 (54,
  'Océano Atlántico Ltda.',
  'Yvonne Moncada',
  'Ing. Gustavo Moncada 8585 Piso 20-A',
  'Buenos Aires',
  '1010',
  'Argentina'),
 (55,
  'Old World Delicatessen',
  'Rene Phillips',
  '2743 Bering St.',
  'Anchorage',
  '99508',
  'USA'),
 (56,
  'Ottilies Käseladen',
  'Henriette Pfalzheim',
  'Mehrheimerstr. 369',
  'Köln',
  '50739',
  'Germany'),
 (57,
  'Paris spécialités',
  'Marie Bertrand',
  '265, boulevard Charonne',
  'Paris',
  '75012',
  'France'),
 (58,
  'Pericles Comidas clásicas',
  'Guillermo Fernández',
  'Calle Dr. Jorge Cash 321',
  'México D.F.',
  '5033',
  'Mexico'),
 (59,
  'Piccolo und mehr',
  'Georg Pipps',
  'Geislweg 14',
  'Salzburg',
  '5020',
  'Austria'),
 (60,
  'Princesa Isabel Vinhoss',
  'Isabel de Castro',
  'Estrada da saúde n. 58',
  'Lisboa',
  '1756',
  'Portugal'),
 (61,
  'Que Delícia',
  'Bernardo Batista',
  'Rua da Panificadora, 12',
  'Rio de Janeiro',
  '02389-673',
  'Brazil'),
 (62,
  'Queen Cozinha',
  'Lúcia Carvalho',
  'Alameda dos Canàrios, 891',
  'São Paulo',
  '05487-020',
  'Brazil'),
 (63,
  'QUICK-Stop',
  'Horst Kloss',
  'Taucherstraße 10',
  'Cunewalde',
  '1307',
  'Germany'),
 (64,
  'Rancho grande',
  'Sergio Gutiérrez',
  'Av. del Libertador 900',
  'Buenos Aires',
  '1010',
  'Argentina'),
 (65,
  'Rattlesnake Canyon Grocery',
  'Paula Wilson',
  '2817 Milton Dr.',
  'Albuquerque',
  '87110',
  'USA'),
 (66,
  'Reggiani Caseifici',
  'Maurizio Moroni',
  'Strada Provinciale 124',
  'Reggio Emilia',
  '42100',
  'Italy'),
 (67,
  'Ricardo Adocicados',
  'Janete Limeira',
  'Av. Copacabana, 267',
  'Rio de Janeiro',
  '02389-890',
  'Brazil'),
 (68,
  'Richter Supermarkt',
  'Michael Holz',
  'Grenzacherweg 237',
  'Genève',
  '1203',
  'Switzerland'),
 (69,
  'Romero y tomillo',
  'Alejandra Camino',
  'Gran Vía, 1',
  'Madrid',
  '28001',
  'Spain'),
 (70,
  'Santé Gourmet',
  'Jonas Bergulfsen',
  'Erling Skakkes gate 78',
  'Stavern',
  '4110',
  'Norway'),
 (71,
  'Save-a-lot Markets',
  'Jose Pavarotti',
  '187 Suffolk Ln.',
  'Boise',
  '83720',
  'USA'),
 (72,
  'Seven Seas Imports',
  'Hari Kumar',
  '90 Wadhurst Rd.',
  'London',
  'OX15 4NB',
  'UK'),
 (73,
  'Simons bistro',
  'Jytte Petersen',
  'Vinbæltet 34',
  'København',
  '1734',
  'Denmark'),
 (74,
  'Spécialités du monde',
  'Dominique Perrier',
  '25, rue Lauriston',
  'Paris',
  '75016',
  'France'),
 (75,
  'Split Rail Beer & Ale',
  'Art Braunschweiger',
  'P.O. Box 555',
  'Lander',
  '82520',
  'USA'),
 (76,
  'Suprêmes délices',
  'Pascale Cartrain',
  'Boulevard Tirou, 255',
  'Charleroi',
  'B-6000',
  'Belgium'),
 (77,
  'The Big Cheese',
  'Liz Nixon',
  '89 Jefferson Way Suite 2',
  'Portland',
  '97201',
  'USA'),
 (78,
  'The Cracker Box',
  'Liu Wong',
  '55 Grizzly Peak Rd.',
  'Butte',
  '59801',
  'USA'),
 (79,
  'Toms Spezialitäten',
  'Karin Josephs',
  'Luisenstr. 48',
  'Münster',
  '44087',
  'Germany'),
 (80,
  'Tortuga Restaurante',
  'Miguel Angel Paolino',
  'Avda. Azteca 123',
  'México D.F.',
  '5033',
  'Mexico'),
 (81,
  'Tradição Hipermercados',
  'Anabela Domingues',
  'Av. Inês de Castro, 414',
  'São Paulo',
  '05634-030',
  'Brazil'),
 (82,
  "Trail''s Head Gourmet Provisioners",
  'Helvetius Nagy',
  '722 DaVinci Blvd.',
  'Kirkland',
  '98034',
  'USA'),
 (83,
  'Vaffeljernet',
  'Palle Ibsen',
  'Smagsløget 45',
  'Århus',
  '8200',
  'Denmark'),
 (84,
  'Victuailles en stock',
  'Mary Saveley',
  '2, rue du Commerce',
  'Lyon',
  '69004',
  'France'),
 (85,
  'Vins et alcools Chevalier',
  'Paul Henriot',
  "59 rue de l''Abbaye",
  'Reims',
  '51100',
  'France'),
 (86,
  'Die Wandernde Kuh',
  'Rita Müller',
  'Adenauerallee 900',
  'Stuttgart',
  '70563',
  'Germany'),
 (87,
  'Wartian Herkku',
  'Pirkko Koskitalo',
  'Torikatu 38',
  'Oulu',
  '90110',
  'Finland'),
 (88,
  'Wellington Importadora',
  'Paula Parente',
  'Rua do Mercado, 12',
  'Resende',
  '08737-363',
  'Brazil'),
 (89,
  'White Clover Markets',
  'Karl Jablonski',
  '305 - 14th Ave. S. Suite 3B',
  'Seattle',
  '98128',
  'USA'),
 (90,
  'Wilman Kala',
  'Matti Karttunen',
  'Keskuskatu 45',
  'Helsinki',
  '21240',
  'Finland'),
 (91, 'Wolski', 'Zbyszek', 'ul. Filtrowa 68', 'Walla', '01-012', 'Poland')]

위의 예시문 역시도 모든 질문에 " OR "" = "을 대입하면 데이터 베이스의 모든 정보를 뽑아올 수 있다.

혹은 악의적으로 ;, 세미콜론을 붙여서 쿼리문을 마무리하고 원하는 쿼리문을 붙일수도 있다. 예를 들면 DROP TABLE ~~~. 내부 테이블 이름을 알아야만 가능한 방법이지만 가능성은 열려있다.

따라서 보호를 위한 매개변수를 이용해야 한다. 여러가지 방법이 있지만 맨 위의 sendQueryWithData함수가 예시가 될 수 있다. 다시 가져와 보겠다.

In [ ]:
def sendQueryWithData(sql, data):
    try:
        with sqlite3.connect(database) as conn:
            cursor = conn.cursor()
            for date in data:
                cursor.execute(sql, date)
            conn.commit()
        
        return cursor.fetchall()
        
    except sqlite3.Error as e:
        print(e)

sql = """INSERT INTO TestTable(LastName, FirstName, Age)
         VALUES (?,?,?)"""
data = [["kim","babo", 26], ["Lee","Jeongsang", 67], ["Park", "Daegi", 40]]
sendQueryWithData(sql, data)

위와 같이 쿼리문을 ?로 뚫어놓고 데이터를 주면 알아서 채워주는 형태이다. 이런 식으로 하면 문자열로 처리해서 sql injection에서 보다 안전할 수 있다.